       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLIENTES.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CLIENTES ASSIGN TO 'C:\cobol\CLIENTES.DAT'
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               FILE STATUS IS CLIENTES-STATUS
               RECORD KEY IS CLIENTES-CHAVE.              
      
       DATA DIVISION.
       FILE SECTION.
       FD CLIENTES.
       01 CLIENTES-REG.
           05 CLIENTES-CHAVE.
               10 CLIENTES-FONE PIC 9(09) BLANK WHEN ZEROS.
           05 CLIENTES-NOME     PIC X(40).
           05 CLIENTES-EMAIL    PIC X(50).
           05 CLIENTES-TELEFONE PIC X(11).           
           05 FILLER            PIC X(20).        
 
       
       WORKING-STORAGE SECTION.
       77 WRK-OPCAO       PIC X.
       77 WRK-MODULO      PIC X(30).
       77 WRK-TECLA       PIC X. 
       77 CLIENTES-STATUS PIC 9(02).
       SCREEN SECTION.
       01 TELA.
           05 LIMPA-TELA.
               10 BLANK SCREEN.
               10 LINE 01 COLUMN 01 ERASE EOL
                  BACKGROUND-COLOR 1.
 
           05 SS-CABECALHO.
               10 LINE 01 COLUMN 02 PIC X(30) FROM WRK-MODULO
                  FOREGROUND-COLOR 6
                  BACKGROUND-COLOR 1.
       01 MENU FOREGROUND-COLOR 6.
           05 LINE 07 COLUMN 15 VALUE "1 - INCLUIR".
           05 LINE 08 COLUMN 15 VALUE "2 - CONSULTAR".
           05 LINE 09 COLUMN 15 VALUE "3 - ALTERAR".
           05 LINE 10 COLUMN 15 VALUE "4 - EXCLUIR".
           05 LINE 11 COLUMN 15 VALUE "5 - RELATORIOS".
           05 LINE 12 COLUMN 15 VALUE "X - ENCERRAR".
           05 LINE 13 COLUMN 15 VALUE "OPCAO: ".
           05 LINE 13 COLUMN 23 USING WRK-OPCAO.
       PROCEDURE DIVISION.
       000-INICIO.
            PERFORM 9000-ABRIR-ARQUIVOS.
             MOVE 'MENU' TO WRK-MODULO.
               DISPLAY TELA.
               ACCEPT MENU.
               EVALUATE WRK-OPCAO
                   WHEN 1
                       PERFORM 0100-INCLUIR
                   WHEN 2
                       CONTINUE
                   WHEN 3
                       CONTINUE
                   WHEN 4
                       CONTINUE
                   WHEN 5
                       CONTINUE
               END-EVALUATE
               PERFORM 9100-FECHAR-ARQUIVOS.
           STOP RUN.
       0100-INCLUIR.
            DISPLAY LIMPA-TELA.
            DISPLAY '-----MODULO DE INCLUSAO-- '.
            ACCEPT WRK-TECLA.           
            DISPLAY LIMPA-TELA.
            
       9000-ABRIR-ARQUIVOS.
            OPEN I-O CLIENTES
            IF CLIENTES-STATUS = 35  THEN
               OPEN OUTPUT CLIENTES
               CLOSE CLIENTES
               OPEN I-O CLIENTES
            END-IF.     
       9100-FECHAR-ARQUIVOS.
            CLOSE CLIENTES.
            
